Highlighted infilling element could not have thickness different from its host because it spans multiple faces.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InfillNoThicknessMultiface { get; }
  Visual Basic
Public Shared ReadOnly Property InfillNoThicknessMultiface As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InfillNoThicknessMultiface {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InfillFailures Class
  Autodesk.Revit.DB Namespace